/*На вход подаётся число, необходимо вывести массив чисел от единицы до этого самого числа, но если число в массиве без отстатка делится на четрые, то это чило умножить на 10.
Например подается число 4, значит будет массив [1, 2, 3, 4] , но четверка в массиве делится на 4 без остатка, значит её умножаем на 10, и функция вернёт [1, 2, 3, 40].
*/ 
<?php
function amplify($num) {
	$new_arr = [];
	for ($i = 1; $i <= $num; $i++) {
		if ($i % 4 == 0) {
			$new_arr[] = $i * 10; 
		} else {
			$new_arr[] = $i;
		}
	}
	return $new_arr;
}
?>