/*на вход подается чисел от пользователя, неободимо узнать является ли само число и сумма его делителей четными числами
*/

let sum = 0;
let num = prompt('Введите число ');
num = Number(num);
for (let i = 1; i <= num; i++) {

    if (num % i == 0) {
        sum = sum + i;
    }
}

if ((sum % 2 == 0) && (num % 2 == 0)) {
    console.log( 'число ' + num + ' и сумма его делителей числа четные числа');
} else if ((num % 2 != 0) && (sum % 2 == 0)) {
    console.log( 'число ' + num + ' нечетное');
} else if ((num % 2 == 0) && (sum % 2 != 0)) {
    console.log( 'сумма делителей числа ' + num + ' нечетная');
} else {
    console.log( 'число ' + num + ' сумма его делителей числа не являются четными числами');
}
