/*Сделайте функцию, которая будет проверять пару чисел на дружественность. 
Дружественные числа - два числа, для которых сумма всех собственных делителей первого числа равна второму числу и наоборот, 
сумма всех собственных делителей второго числа равна первому числу.
*/ 
<?php
function friendlyNumbers($a, $b)
{
    $arr_a = [];
    $arr_b = [];
    for($i = 1; $i < $a; $i++) {
        if ($a % $i == 0) {
            $arr_a[] = $i;
        }
    }
    for($x = 1; $x < $b; $x++) {
        if ($b % $x == 0) {
            $arr_b[] = $x;
        }
    }
    return ((array_sum($arr_a) == $b) && (array_sum($arr_b) == $a)) ? true : false;
}
?>