/*На вход подаётся две строки из символов. Первая в формате "abcdef", вторая в формате "c-e". Это значит, что мы должны заменить все символы в первой строке,
которые входят в диапазон второй строки (а это "c - d - e"), на символ '#'. В случае строк "abcdef" и "c-e" функция вернёт "ab###f".
*/ 
<?php
function replace($str, $r) {
	$r = range($r[0], $r[2]);
	for ($i = 0; $i < strlen($str); $i++) {
		if (in_array($str[$i], $r)) {
			$str = str_replace($str[$i], '#', $str);
		}
	}
	return $str;
}
?>